import React, {useState} from 'react';
import school from "./../../../images/school.png"
import child from "./../../../images/students.png"
import book from "./../../../images/book.png"
import teach from "./../../../images/teach.png"
import {media} from "../../media";

const Info = () => {

    const [modal, setModal] = useState(false)

    return (
        <section id="info">
            <div className="container">
                <div className="info-general__width"/>
                <div className="info-general">
                    <div className="info-general__block">
                        <div style={{width: media(250, 625), height: media(190, 438), margin: media(10, 25)}}/>
                        <img src={school} alt="img" style={{width: media(250, 625), height: media(190, 438)}}/>
                    </div>
                    <div className="info-general__block2">
                        <h1>Мектеп тууралуу маалымат</h1>
                        {/*<p>СРЕДНЯЯ ОБЩЕОБРАЗОВАТЕЛЬНАЯ ШКОЛА №1.</p>*/}
                        <div className="info-general__block2__gen">
                            <div className="info-general__block2__gen__cer"
                                 style={{width: media(70, 100), height: media(70, 100)}}>
                                <img src={child} alt="img"/>
                            </div>
                            <div className="info-general__block2__gen__item">
                                <h2>Учурдагы окуучулар</h2>
                                <h3>455</h3>
                            </div>
                        </div>
                        <div className="info-general__block2__gen">
                            <div className="info-general__block2__gen__cer"
                                 style={{width: media(70, 100), height: media(70, 100)}}>
                                <img src={book} alt="img"/>
                            </div>
                            <div className="info-general__block2__gen__item">
                                <h2>Жалпы китептердин саны</h2>
                                <h3>4572</h3>
                            </div>
                        </div>
                        <div className="info-general__block2__gen">
                            <div className="info-general__block2__gen__cer"
                                 style={{width: media(70, 100), height: media(70, 100)}}>
                                <img src={teach} alt="img"/>
                            </div>
                            <div className="info-general__block2__gen__item">
                                <h2>Учурдагы мугалимдер</h2>
                                <h3>47</h3>
                            </div>
                        </div>
                    </div>
                </div>
                <div className="info-general2">
                    {/*<p style={{fontSize: media(16, 18)}}> Вот уже на протяжении нескольких лет наша школа распахивает*/}
                    {/*    свои двери учителям, ученикам и их родителям. И первый*/}
                    {/*    человек который встречает их на пороге школы — это директор. Как важно иметь в школе*/}
                    {/*    руководителя, который смог организовать и направить всю деятельность коллектива педагогов и*/}
                    {/*    учеников в нужное русло. На протяжении этих лет нашу школу возглавляли мудрые и талантливые,*/}
                    {/*    инициативные люди.</p>*/}
                    <button
                        onClick={() => setModal(true)}
                    >Толук маалымат
                    </button>
                    {modal && (
                        <div className="info-general2__modal">
                            <div className="info-general2__modal__block">
                                <h1 onClick={() => setModal(false)}>Жабуу</h1>
                                <p>Чоң-Алай районундагы Жоомарт Бөкөнбаев атындагы орто мектеби
                                    Мектептин аталышы: “Жоомарт Бөкөнбаев” атындагы орто мектеби мекемеси
                                    Түзүлүү тарыхы: Чоң-Алай районунун Ачы-Суу айылында 1975-жылы Жоомарт Бөкөнбаев
                                    атындагы 8 жылдык мектеп болуп ачылып, анын директору Жумаев Канабат, окуу бөлүмүнүн
                                    башчысы Тажибаев Имамат, уюштуруучу Матисламов Абдрахман болгон жана мектепте 12
                                    мугалим эмгектенген. Ошол эле жылдары 80 орундуу жатак интернаты
                                    уюштурулуп,чабандардын балдары окуган.Жалпы 60 окуучу болгон.
                                    1976-жылы 9 жылдык, 1977-жылы жалпы орто мектеп болуп өзгөргөн.1978-жылы жер
                                    титирөөдөн мектептин имараты жараксыз абалга келип, анын ордуна 80 орундуу учурдагы
                                    мектептин негизги корпусу курулган. Айылда элдин саны өсүп, Кызыл-Суу совхозунун
                                    канторасы мектепке кошумча корпус катары берилип бүгүнкү күнгө чейин пайдаланылып
                                    иштеп келе жатат.
                                    Алгачкы мугалимдер: Матисламов Абдырахман , Курбанбаева Кимсан, Курбанбаева Умсун,
                                    Ибраимов Жээнбай, Сеитбеков Абибилла, Тажибаев Имамат, Юлдашева Назира, Шаншоев Абаз
                                    ж.б.
                                    Мектепти жетектеген директорлор: 1975-1981-жылдары Жумаев Канабат, 1981-1984-жылдары
                                    Каримова Дөөлат, 1984-1989-жылдары Тажибаев Имамат, 1989-1994-жылдары Исмаилов
                                    Абдразак, 1994-2004-жылдары Шаншоев Абазбек, 2004-2010-жылдары Төлөнбаев Асан,
                                    2016-жылдан баштап Бурканов Акылбек.
                                    Окуучулардын саны: 455 окуучу, мугалимдердин саны: 47
                                    Мектептеги мугалимдердин курамы боюнча: жалпы 47 мугалим, жогорку билимдүүсү 39,
                                    пед.орто билимдүүлөр 8, Билим берүүнүн мыктылары 3, КРнын Билим берүү жана илим
                                    министрлигинин Ардак Громатасы 2, жаш мугалимдер 10.
                                    Мектептен чыккан белгилүү инсандар: Саясий илимдердин кандидаты,Билим берүү жана
                                    илим министрлигинин кесиптик жана жогорку билим берүү боюнча орун басары Абазбек
                                    уулу Расул, жеке ишкер мектепке жакындан жардам берип келе жаткан атуулубуз
                                    Галдыбаев Жаманкул, Кыргыз Республикасынын мамлекеттик кызматынын ички иштер
                                    кызматкери, подполковник Төлөнбаев Шамансур,чек араны коргоо кызматынын
                                    подполковниги Абдилазизов Досназар, Ош жаңырыгы газетасынын кабарчысы,журналистка
                                    Мамазияева Гүлбара ж.б.
                                </p>
                            </div>
                        </div>
                    )}
                </div>
            </div>
        </section>
    );
};

export default Info;